'''
Використовуючи підпрограму для знаходження найбільшого спільного дільника (НСД), знайти значення виразу
S=(НСД(a,b)+ НСД(a,4))+ НСД(24,b)
'''
# Позначення
'''
a - якесь число int
b - якесь число int
s - результат
'''
# Введення даних
a = int(input('Please write a : '))
b = int(input('Please write b : '))

# Допоміжна програма
def nsd(n,m):
    while n*m != 0:
        if n >= m:
            n = n % m
        else:
            m = m % n
    return n + m
S = (nsd(a,b) + nsd(a,4)) + nsd(24,b)
print('Найбільший спільний дільник : {0}'.format(S))
